{
  "users": [
    {
      "id": "1",
      "user": "swayam",
      "password": "password",
      "role": "admin"
    },
    {
      "id": "2",
      "user": "teacher1",
      "password": "pass123",
      "role": "teacher"
    }
  ],
  "courses": [
    {
      "code": "3K2128",
      "name": "Dashboards",
      "theoryTime": "3 hrs",
      "practiceTime": "3 hrs",
      "description": "Building dynamic dashboards...",
      "topicsString": "Analytics, Data Visualization, Dashboards",
      "topics": [
        "Analytics",
        "Data Visualization",
        "Dashboards"
      ],
      "id": "c454"
    },
    {
      "code": "1J2124",
      "name": "Machine Learning",
      "theoryTime": "4 hrs",
      "practiceTime": "4 hrs",
      "description": "Machine Learning fundamentals...",
      "topicsString": "Machine Learning, Big Data, Business Acumen",
      "topics": [
        "Machine Learning",
        "Big Data",
        "Business Acumen"
      ],
      "id": "44e8"
    },
    {
      "code": "3P2130",
      "name": "Blockchain Basics",
      "theoryTime": "4 hrs",
      "practiceTime": "4 hrs",
      "description": "Understanding blockchain technology...",
      "topics": [
        "Bitcoin",
        "Ethereum",
        "Smart Contracts"
      ],
      "id": "e890"
    },
    {
      "code": "1Q2131",
      "name": "Cloud Computing",
      "theoryTime": "6 hrs",
      "practiceTime": "6 hrs",
      "description": "Cloud services and architecture...",
      "topics": [
        "AWS",
        "Azure",
        "Google Cloud"
      ],
      "id": "726b"
    },
    {
      "code": "2R2132",
      "name": "Cyber Security",
      "theoryTime": "5 hrs",
      "practiceTime": "5 hrs",
      "description": "Cybersecurity principles and practices...",
      "topics": [
        "Network Security",
        "Ethical Hacking",
        "Cryptography"
      ],
      "id": "b7a8"
    },
    {
      "code": "3S2133",
      "name": "AI and Deep Learning",
      "theoryTime": "7 hrs",
      "practiceTime": "7 hrs",
      "description": "Artificial Intelligence and Deep Learning...",
      "topics": [
        "Neural Networks",
        "CNN",
        "NLP"
      ],
      "id": "0fae",
      "topicsString": "Neural Networks, CNN, NLP"
    },
    {
      "code": "1T2134",
      "name": "DevOps",
      "theoryTime": "6 hrs",
      "practiceTime": "6 hrs",
      "description": "DevOps principles and CI/CD pipelines...",
      "topics": [
        "Docker",
        "Kubernetes",
        "Jenkins"
      ],
      "id": "e79e"
    },
    {
      "code": "2U2135",
      "name": "Software Engineering",
      "theoryTime": "5 hrs",
      "practiceTime": "5 hrs",
      "description": "Software development lifecycle...",
      "topics": [
        "Agile",
        "Scrum",
        "Software Testing"
      ],
      "id": "b19d"
    },
    {
      "code": "3V2136",
      "name": "Web Development",
      "theoryTime": "5 hrs",
      "practiceTime": "5 hrs",
      "description": "Full-stack web development...",
      "topics": [
        "HTML",
        "CSS",
        "JavaScript",
        "React"
      ],
      "id": "fd6b"
    },
    {
      "code": "1W2137",
      "name": "Big Data Analytics",
      "theoryTime": "6 hrs",
      "practiceTime": "6 hrs",
      "description": "Processing and analyzing big data...",
      "topics": [
        "Hadoop",
        "Spark",
        "Kafka"
      ],
      "id": "82d2"
    },
    {
      "id": "f7d8",
      "code": "00000",
      "name": "TEST",
      "theoryTime": "11 hr",
      "practiceTime": "11 hr",
      "description": "This is a test description",
      "topicsString": "",
      "topics": []
    },
    {
      "id": "0e7b",
      "code": "likun",
      "name": "likun",
      "theoryTime": "100 hrs",
      "practiceTime": "100 hrs",
      "description": "THis is likun test description",
      "topicsString": "",
      "topics": []
    },
    {
      "id": "a478",
      "code": "sway",
      "name": "swayam",
      "theoryTime": "100 hrs",
      "practiceTime": "100 hrs",
      "description": "Buildin\ng dynamic dashboards...",
      "topicsString": "",
      "topics": []
    }
  ],

  "topics" : [
    {
      "topicId": 1,
      "topicName": "Sharable bifurcated algorithm",
      "theoryTime": "3 hours",
      "practiceTime": "2 hours",
      "summary": "Cause bill scientist nation opportunity. Ahead despite measure. Night respond red. Determine operation speak according south recently.",
      "content": "Choice whatever from behavior benefit. Page southern role movie win her. Fall pick those gun court attorney product. World talk term herself law. Class great prove reduce raise author. Move each left establish. Detail food shoulder argue start source husband. Decision wall then fire. How trip learn enter east no enjoy. Investment on gun young catch management sense technology.",
      "files": [
        "claim.pdf",
        "product.pptx"
      ]
    },
    {
      "topicId": 2,
      "topicName": "Topic 2: Diverse systemic interface",
      "theoryTime": "3 hours",
      "practiceTime": "1 hours",
      "summary": "Other life edge network wall quite. Race Mr environment political. Fall citizen about reveal. Will seven medical blood personal. Participant check several much single morning a.",
      "content": "Affect upon these story film around there. Beat magazine attorney set. Campaign little near enter. Institution deep much role cut find yet practice. Tonight later easy ask again network. Detail audience piece director town teacher audience draw. Democrat car very number line six space. Behind probably great in tell. Pull worker better. Rock song body court movie cell.",
      "files": [
        "cover.pdf",
        "family.pptx"
      ]
    },
    {
      "topicId": 3,
      "topicName": "Topic 3: Persistent dynamic archive",
      "theoryTime": "2 hours",
      "practiceTime": "3 hours",
      "summary": "Present music address. Unit support coach magazine. Ten total clearly able hospital.",
      "content": "Institution whatever yet new responsibility. Couple design around save. Security arm once me. Church whether bag control organization push dog. Walk now often always. Information on mission various. Prove fire enter capital population. First sell authority leader your you available. Media car give attention each. Citizen street region particularly would. Account stage federal professional voice care break.",
      "files": [
        "both.pdf",
        "situation.pptx"
      ]
    },
    {
      "topicId": 4,
      "topicName": "Topic 4: Reactive coherent flexibility",
      "theoryTime": "2 hours",
      "practiceTime": "3 hours",
      "summary": "Data plant enough major town suffer. Plant stop analysis four. Pm energy scientist necessary. Night born war real chance along.",
      "content": "Need involve among half value win always group. Project government nice themselves wind. Understand door class son. Thing agent say forward. Soon ten specific environment skin blue. Teach develop staff. Glass star the development process huge everything. Whom evidence political hundred. Former agree theory end oil worker although. Its rock finish paper memory history office effort.",
      "files": [
        "section.pdf",
        "least.pptx"
      ]
    },
    {
      "topicId": 5,
      "topicName": "Topic 5: Adaptive multi-state workforce",
      "theoryTime": "3 hours",
      "practiceTime": "3 hours",
      "summary": "Issue we TV perhaps professional by. Medical project for recent never. Inside wait quality total past. Image street fight decision size.",
      "content": "Let kind degree list top somebody. Probably exist professional people. Stand seem pull different. Challenge animal worker particularly shoulder. Increase picture create recent manager during prevent. Throughout team those. Despite sound receive let newspaper true. Lead soon property write. Fish sense kind spring throughout interview trade knowledge. Season listen else easy. She miss phone ever back. Doctor from throw ball character. Really relationship ask imagine my indeed.",
      "files": [
        "design.pdf",
        "there.pptx"
      ]
    },
    {
      "topicId": 6,
      "topicName": "Topic 6: Operative human-resource throughput",
      "theoryTime": "3 hours",
      "practiceTime": "3 hours",
      "summary": "Herself accept goal send table well industry. Son today major event magazine home protect. Right subject try wonder move trade.",
      "content": "Production base investment term consider employee force. Force seven here sell story edge bank. See appear weight. Practice sit prepare senior wear. Stuff perform draw list boy. Let eight hard paper white. Sing clearly find official. Office traditional heart walk cup. Real physical big significant sure outside building worker. Girl into have. Positive actually information majority item gun through. Religious itself safe whole establish space Mrs. Let stay or focus early various everything.",
      "files": [
        "little.pdf",
        "either.pptx"
      ]
    },
    {
      "topicId": 7,
      "topicName": "Topic 7: Versatile maximized open system",
      "theoryTime": "3 hours",
      "practiceTime": "3 hours",
      "summary": "Agreement surface consider deep something future. Red everybody act way beat result major serve. Position make society behavior develop reality fill. Hard network gas you nearly goal law fill. Building court build movie several.",
      "content": "Describe machine right with modern. Wonder strategy fast guess few. Call animal approach factor want point sell. Their off light key. Whole education technology box. Husband available picture approach. Specific we be easy. Share paper so difficult mission late kind.",
      "files": [
        "trade.pdf",
        "per.pptx"
      ]
    },
    {
      "topicId": 8,
      "topicName": "Topic 8: Optimized fault-tolerant open system",
      "theoryTime": "3 hours",
      "practiceTime": "1 hours",
      "summary": "Way debate decision produce. Dream necessary choose impact. Like allow explain executive teacher author do enough. Operation sound cup boy different chance enter central. Coach film see notice. Keep light fight I evening.",
      "content": "Just our threat same page ago director. Onto again share start office several compare. Prepare trouble consider one play man before. Impact fly bit claim in many. Spend nearly lawyer fire follow wife. Ten stay ability thank left approach. Gun series personal service data near until. Thing machine ahead picture son report. Nearly need behavior yeah tree. Water positive child usually factor relate indeed. Woman during necessary himself two meet these. Everybody so increase various.",
      "files": [
        "movement.pdf",
        "example.pptx"
      ]
    },
    {
      "topicId": 9,
      "topicName": "Topic 9: Adaptive executive success",
      "theoryTime": "2 hours",
      "practiceTime": "3 hours",
      "summary": "Tend land machine forward several help usually. Wonder draw him task improve. Seat relate specific history professional star. Manager already maybe opportunity. Them key moment lead. Improve pressure child light.",
      "content": "Perhaps however bag forget purpose move. Phone thought maintain must pay doctor. Young section its better plant. Kitchen really tough animal. Fall hear certainly most. Radio conference company participant him raise marriage. Central leave effect effort act source top quality. Available war write federal. Real lead few yourself table blood.",
      "files": [
        "I.pdf",
        "owner.pptx"
      ]
    },
    {
      "topicId": 10,
      "topicName": "Topic 10: Multi-channeled object-oriented frame",
      "theoryTime": "3 hours",
      "practiceTime": "2 hours",
      "summary": "Ever not rate seat any paper. Strategy total simply discover soon despite couple. Question return process stuff pick.",
      "content": "Final kid often. Bed far section compare. Skill theory hand maybe. Store either station loss southern. Sound life away senior difficult put. Whose source hand so add Mr. Happy see energy herself police he push. Agent this no trip determine as statement. Power bring animal also you. Best thought career law. Industry score choice increase between majority impact. Allow have kitchen wear talk. Wonder happen top population. Huge couple business summer.",
      "files": [
        "look.pdf",
        "benefit.pptx"
      ]
    },
    {
      "topicId": 11,
      "topicName": "Topic 11: Switchable didactic project",
      "theoryTime": "3 hours",
      "practiceTime": "3 hours",
      "summary": "Skill during call. Day stop never only spend do similar. Able teach certain candidate economy company produce ago.",
      "content": "So draw food company appear score. Box as large gun order later develop. Analysis situation term miss leader who article look. International blue Republican kitchen tonight focus. Assume every plan nature. Herself our far measure involve soldier.",
      "files": [
        "building.pdf",
        "tonight.pptx"
      ]
    },
    {
      "topicId": 12,
      "topicName": "Topic 12: Streamlined solution-oriented throughput",
      "theoryTime": "3 hours",
      "practiceTime": "3 hours",
      "summary": "Later direction fund law indeed believe. Fine effort well rather listen before. Behavior benefit school speech. Art what no prove improve them wait.",
      "content": "Why outside goal. Medical choice lot suggest glass news boy. Off southern suddenly window stand. Push news participant price really ahead event several. Go consider century price attorney scientist. Begin most heavy. Game have return since nothing be apply. Senior anyone bank kitchen. Magazine kind event sense box involve. Question or money final determine. Area daughter war should share face build market.",
      "files": [
        "law.pdf",
        "continue.pptx"
      ]
    },
    {
      "topicId": 13,
      "topicName": "Topic 13: De-engineered homogeneous monitoring",
      "theoryTime": "3 hours",
      "practiceTime": "1 hours",
      "summary": "Street south author technology amount affect TV. Office of remember individual boy again. Commercial way least ready gun join. During open model how. Second develop single baby plan. Member town glass road standard spring door.",
      "content": "Culture own set pretty concern. Management senior service large under north play person. Firm key light place someone option goal avoid. Later arm story baby ten talk past. His oil west school American training occur. Focus little character artist billion. Word base position always remain yard.",
      "files": [
        "need.pdf",
        "necessary.pptx"
      ]
    },
    {
      "topicId": 14,
      "topicName": "Topic 14: Seamless cohesive hierarchy",
      "theoryTime": "2 hours",
      "practiceTime": "2 hours",
      "summary": "Simple quickly appear piece free form. Question exist rich prevent trade their four. Professional true financial prevent product can remember be. Heavy social spend prove stock school rate. Behavior provide meet adult final week game.",
      "content": "Difficult case baby such big. Strong this also from short capital heavy. Congress realize person total. Analysis hair rest wide particular sell. Doctor dream whole six tough create question. Worker left example high month whom stage. Catch economic political them never bill suffer surface. Base civil last message store. Watch develop later glass. Increase how hear. Yes heart agreement us stuff practice. Case expert stop receive.",
      "files": [
        "chair.pdf",
        "song.pptx"
      ]
    },
    {
      "topicId": 15,
      "topicName": "Topic 15: Triple-buffered methodical knowledge user",
      "theoryTime": "3 hours",
      "practiceTime": "1 hours",
      "summary": "Eight strong nature. Month book explain feeling answer information soldier lead. Student matter movie place.",
      "content": "Responsibility fact ability good number. Professor beat window attack. Name skill medical after them analysis hit. Effect administration small general run pick. Same forward and national spend compare single let. Place specific as simply leader fall analysis. Though firm financial huge spring. Education send course ground sit tend forward. Son join hundred keep. Fund cost reality happen something entire. Risk bad own state. Family bill foreign fast knowledge response coach. Goal amount thank good your ever.",
      "files": [
        "strong.pdf",
        "yourself.pptx"
      ]
    },
    {
      "topicId": 16,
      "topicName": "Topic 16: Centralized asynchronous secured line",
      "theoryTime": "3 hours",
      "practiceTime": "2 hours",
      "summary": "Song quickly well central parent sit alone. Door population gun we. Painting quickly we. Know baby case happen fire everything. Ago control military trial.",
      "content": "Simple region Democrat partner really. Customer career available common require young specific. Property remember nearly face feel church. Soldier meeting building cut. Door management guess occur. Sound necessary partner beat finally yourself rest. Improve important offer by first avoid letter.",
      "files": [
        "nation.pdf",
        "guy.pptx"
      ]
    },
    {
      "topicId": 17,
      "topicName": "Topic 17: De-engineered zero-defect neural-net",
      "theoryTime": "3 hours",
      "practiceTime": "3 hours",
      "summary": "Item treat area buy. Fight class various different. Thus suffer economy play nearly by field. Behavior political option oil commercial person top.",
      "content": "American tell ball we side enough decision. Indicate police marriage phone face what lot. Father authority art keep machine daughter. Century technology floor write generation human set middle. Five letter environment easy. Anything war ten industry. Spend value return couple. Marriage method material final. Bed hotel lead. Democrat good anything manager think.",
      "files": [
        "ready.pdf",
        "remember.pptx"
      ]
    },
    {
      "topicId": 18,
      "topicName": "Topic 18: Phased executive monitoring",
      "theoryTime": "1 hours",
      "practiceTime": "1 hours",
      "summary": "Think road shake hand. Anything no guy eye hit late. Evidence writer quite budget window hour some. Newspaper hand certain own husband American. Case four listen.",
      "content": "Paper middle foreign party. Hotel pattern successful order. Stock mother remember feel staff happy purpose. On someone rise read ago listen. Officer return on color pick people subject challenge. All way body affect finish. Include data maybe particularly. Their save artist catch debate foot production. Heavy what least mouth national put test. Particular court east newspaper different. Side relate real major look.",
      "files": [
        "opportunity.pdf",
        "world.pptx"
      ]
    },
    {
      "topicId": 19,
      "topicName": "Topic 19: Up-sized even-keeled forecast",
      "theoryTime": "1 hours",
      "practiceTime": "3 hours",
      "summary": "Time house generation significant chair among. Get kind either look. Still even no even body. Dream anything toward difficult do beyond form line. Accept nearly upon imagine. Local current white fly position traditional become.",
      "content": "Movement rich view tree company. Value already structure small. View while unit theory. Fear owner up. Expect writer myself management voice surface. Evening speak former room possible responsibility add. So nothing serious compare task today. Middle beautiful protect continue cell food. According himself land environment form. Reveal activity president realize artist brother fill if. Type thousand show real police wait happen. Despite card check security paper. Reduce tree serious soon stay seven.",
      "files": [
        "response.pdf",
        "somebody.pptx"
      ]
    },
    {
      "topicId": 20,
      "topicName": "Topic 20: Right-sized zero tolerance artificial intelligence",
      "theoryTime": "3 hours",
      "practiceTime": "2 hours",
      "summary": "Back nor article natural measure of. Clearly take kind quite. Major together knowledge argue car indeed nor next. Rich how staff second official. Interest red must. Various attorney value all.",
      "content": "Shoulder she within position. Hear through large true help bag. Card team budget year hotel camera without. Series without leg. Interest here discover leave choice country themselves. Allow produce past view. Drive attack order. Our reflect any scientist I doctor describe. Cell year doctor trouble. Five our pull fly few century produce. Including every news option same.",
      "files": [
        "continue.pdf",
        "produce.pptx"
      ]
    },
    {
      "topicId": 21,
      "topicName": "Topic 21: Synergistic interactive open architecture",
      "theoryTime": "2 hours",
      "practiceTime": "1 hours",
      "summary": "Skill five indicate chance heavy senior. Drive different tax certain leg arm include. Newspaper care drug data position two. Begin right couple environmental purpose owner. Could seven right next.",
      "content": "Thank four whatever address view. Section senior trial receive. However dream focus executive letter. Final growth third letter sort reveal. Trial have including none determine certainly. Network once result far cultural. Here street material pressure range. Shake major rich science leave. College result major true my politics. Model stuff avoid stand. Share include successful. Attack character despite lay art.",
      "files": [
        "pull.pdf",
        "reflect.pptx"
      ]
    },
    {
      "topicId": 22,
      "topicName": "Topic 22: Seamless mission-critical protocol",
      "theoryTime": "2 hours",
      "practiceTime": "1 hours",
      "summary": "Necessary activity morning ever within admit spend. South travel blood benefit chance court. Education great some bad where learn during.",
      "content": "Range summer president teach service. If help live PM. Bar suddenly population former. Thus try discover top. Little another avoid understand tonight nor allow. Administration debate certain star start up. Class drive strong home to. Himself science so ready bad seat.",
      "files": [
        "half.pdf",
        "argue.pptx"
      ]
    },
    {
      "topicId": 23,
      "topicName": "Topic 23: Cross-platform intermediate emulation",
      "theoryTime": "1 hours",
      "practiceTime": "2 hours",
      "summary": "Western however similar ahead event yeah make green. It quickly produce beat peace something. Bank child Republican plant. First blood accept final growth especially. Beautiful issue news mention. Ago government behavior our.",
      "content": "Activity including single right nice yeah. Occur college herself catch feeling. Certainly cold every feel site guess want. Many pattern leader career according how success here. Key issue statement prepare organization feel. Water cut fire who why fact reason make. Site for exactly skill half usually customer. Conference should agree road wall decide something. Standard somebody important material. Drug probably resource smile available.",
      "files": [
        "piece.pdf",
        "measure.pptx"
      ]
    },
    {
      "topicId": 24,
      "topicName": "Topic 24: Reduced impactful monitoring",
      "theoryTime": "3 hours",
      "practiceTime": "3 hours",
      "summary": "Already why reduce speech order trial body. Price great positive and worker. Whom former someone black better develop. Newspaper reach determine hear leg quickly real. General agency bit indeed.",
      "content": "Story role give gas. Miss give best reveal laugh. Feel special boy support. Quality clearly worker during. Necessary former interview left. Picture control price how scene third. Or home relate day sell speak artist.",
      "files": [
        "blue.pdf",
        "successful.pptx"
      ]
    },
    {
      "topicId": 25,
      "topicName": "Topic 25: Public-key contextually-based hierarchy",
      "theoryTime": "2 hours",
      "practiceTime": "1 hours",
      "summary": "Energy television month police. Home hotel box goal leader common purpose song. Opportunity public finish draw bring health center home. Case himself control player really population yourself never. Eye cost success people tend weight machine.",
      "content": "White measure manager range indeed style. Cold not somebody determine allow different eye. Not significant manager member of environmental myself. My series service kid despite interesting. Fear yourself last give stage. Tend bring speech decide scene ready. Plan coach cause deal deal arrive go exactly. Collection without fall of weight method too.",
      "files": [
        "teacher.pdf",
        "beyond.pptx"
      ]
    },
    {
      "topicId": 26,
      "topicName": "Topic 26: Devolved web-enabled toolset",
      "theoryTime": "2 hours",
      "practiceTime": "1 hours",
      "summary": "Reduce car chair focus. Seven put majority officer environmental. Heart away some shoulder idea seek. Lawyer maintain old than suggest behavior.",
      "content": "Sure somebody huge why station manager. Stock front official not magazine gas. Animal phone student. Buy tax kid. Yeah into yet. Think few themselves theory. Pressure economy head tough. Appear personal rise sense. Pretty region ability live car difficult. Act receive stage write institution car. Director become south billion.",
      "files": [
        "hold.pdf",
        "upon.pptx"
      ]
    },
    {
      "topicId": 27,
      "topicName": "Topic 27: Innovative client-driven implementation",
      "theoryTime": "1 hours",
      "practiceTime": "3 hours",
      "summary": "Most across practice key. Physical character in rather team. To cause but role.",
      "content": "Fire cause everybody base network outside. Expect wait agree suggest then day parent country. Far approach today west manager both. Point audience thousand activity guess first hit. Inside national common likely would authority onto. Energy always art. Media pick may indeed reduce bar. Mrs check base bad TV window choice. Hospital plant strong race at recognize. Around beat its law participant.",
      "files": [
        "for.pdf",
        "reflect.pptx"
      ]
    },
    {
      "topicId": 28,
      "topicName": "Topic 28: User-centric stable support",
      "theoryTime": "1 hours",
      "practiceTime": "1 hours",
      "summary": "Reduce clearly well mission. Cold camera sit environmental though. Friend investment model.",
      "content": "Physical many member area teacher cold church. Thus purpose boy scientist. Analysis television each. Hair turn condition whether along sort research. Different eat trouble floor step number. Maybe top conference source. West attention let. Similar financial beat lead hard. Nor fight performance less option.",
      "files": [
        "minute.pdf",
        "spring.pptx"
      ]
    },
    {
      "topicId": 29,
      "topicName": "Topic 29: Vision-oriented dedicated superstructure",
      "theoryTime": "3 hours",
      "practiceTime": "1 hours",
      "summary": "Usually agency must. Week ability price. Billion morning draw man art.",
      "content": "Behavior TV today mind red. Learn security oil measure PM hour. Nothing itself who door end fire song red. Fish evening avoid dark sister once. Black last finish building. Who debate final enter build citizen. Step recent American structure foreign.",
      "files": [
        "benefit.pdf",
        "seek.pptx"
      ]
    },
    {
      "topicId": 30,
      "topicName": "Topic 30: Fully-configurable heuristic infrastructure",
      "theoryTime": "3 hours",
      "practiceTime": "1 hours",
      "summary": "Star community weight take new. Economic left sound cause activity store work. Cup hundred rather visit. Old else spend against.",
      "content": "Total kitchen can toward stop. Business walk anything under item right. Ahead raise common Democrat cost evidence third. Pass pay positive. Include nearly article evidence case current this. Eat yes myself affect him require look.",
      "files": [
        "station.pdf",
        "memory.pptx"
      ]
    }
  ]
}
